In [59]:
import pandas as pd
import numpy as np
import category_encoders as catenc

In [77]:
data_df = pd.read_excel('test_Data.xlsx')

In [78]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14745 entries, 0 to 14744
Data columns (total 25 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               14745 non-null  int64
 1   Frequency        14745 non-null  object
 2   InstlmentMode    14745 non-null  object
 3   LoanStatus       14745 non-null  object
 4   PaymentMode      14745 non-null  object
 5   BranchID         14745 non-null  int64
 6   Area             14199 non-null  object
 7   Tenure           14745 non-null  int64
 8   AssetCost        14745 non-null  int64
 9   AmountFinance    14745 non-null  float64
 10  DisbursalAmount  14745 non-null  float64
 11  EMI              14745 non-null  float64
 12  DisbursalDate    14745 non-null  datetime64[ns]
 13  MaturityDAte     14745 non-null  datetime64[ns]
 14  AuthDate         14745 non-null  datetime64[ns]
 15  AssetID          14745 non-null  int64
 16  ManufacturerID   14743 non-null  float64
 17  SupplierID       14745 non-null  int64
 18  LTV              14745 non-null  float64
 19  SEX              14740 non-null  object
 20  AGE              14738 non-null  float64
 21  MonthlyIncome    14731 non-null  float64
 22  City             14745 non-null  object
 23  State            14745 non-null  object
 24  ZiPCODE          14744 non-null  float64
dtypes: datetime64[ns](3), float64(8), int64(6), object(8)
memory usage: 2.8+ MB

In [79]:
data_df.dropna(inplace=True)

In [80]:
data_df['ZiPCODE'].nunique()

2062

In [81]:
encoder_zipcode = catenc.HashingEncoder(n_components=10, cols=['ZiPCODE'])
encoded_df = encoder_zipcode.fit_transform(data_df)

In [82]:
encoded_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14182 entries, 0 to 14181
Data columns (total 34 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   col_0            14182 non-null  int64
 1   col_1            14182 non-null  int64
 2   col_2            14182 non-null  int64
 3   col_3            14182 non-null  int64
 4   col_4            14182 non-null  int64
 5   col_5            14182 non-null  int64
 6   col_6            14182 non-null  int64
 7   col_7            14182 non-null  int64
 8   col_8            14182 non-null  int64
 9   col_9            14182 non-null  int64
 10  ID               14182 non-null  int64
 11  Frequency        14182 non-null  object
 12  InstlmentMode    14182 non-null  object
 13  LoanStatus       14182 non-null  object
 14  PaymentMode      14182 non-null  object
 15  BranchID         14182 non-null  int64
 16  Area             14182 non-null  object
 17  Tenure           14182 non-null  int64
 18  AssetCost        14182 non-null  int64
 19  AmountFinance    14182 non-null  float64
 20  DisbursalAmount  14182 non-null  float64
 21  EMI              14182 non-null  float64
 22  DisbursalDate    14182 non-null  datetime64[ns]
 23  MaturityDAte     14182 non-null  datetime64[ns]
 24  AuthDate         14182 non-null  datetime64[ns]
 25  AssetID          14182 non-null  int64
 26  ManufacturerID   14182 non-null  float64
 27  SupplierID       14182 non-null  int64
 28  LTV              14182 non-null  float64
 29  SEX              14182 non-null  object
 30  AGE              14182 non-null  float64
 31  MonthlyIncome    14182 non-null  float64
 32  City             14182 non-null  object
 33  State            14182 non-null  object
dtypes: datetime64[ns](3), float64(7), int64(16), object(8)
memory usage: 3.7+ MB

In [83]:
encoded_df.head()

,col_0,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9,...,AuthDate,AssetID,ManufacturerID,SupplierID,LTV,SEX,AGE,MonthlyIncome,City,State
0,0,0,0,1,0,0,0,0,0,0,...,2011-12-29,3524747,1046.0,22354,75.83,M,50.0,32069.00,GUNA,MADHYA PRADESH
1,0,0,0,1,0,0,0,0,0,0,...,2012-04-28,4985862,1046.0,22354,57.44,M,35.0,25000.00,GUNA,MADHYA PRADESH
2,0,0,0,1,0,0,0,0,0,0,...,2013-10-22,12881783,1060.0,65929,68.97,M,37.0,23333.33,GUNA,MADHYA PRADESH
3,0,0,0,0,0,0,0,0,0,1,...,2012-11-30,7911110,1049.0,38493,59.09,M,48.0,12500.00,JAGATSINGHAPUR,ORISSA
4,0,0,0,1,0,0,0,0,0,0,...,2013-07-31,11813447,1046.0,73027,57.34,F,49.0,41666.67,JAJAPUR,ORISSA

In [84]:
data_df['Area'].nunique()

80

In [85]:
binaryencoder = catenc.BinaryEncoder()
binaryencoder.fit_transform(data_df['Area']).head()

   Area_0  Area_1  Area_2  Area_3  Area_4  Area_5  Area_6  Area_7
0       0       0       0       0       0       0       0       1
1       0       0       0       0       0       0       0       1
2       0       0       0       0       0       0       0       1
4       0       0       0       0       0       0       1       0
5       0       0       0       0       0       0       1       0

In [86]:
data_df['City'].nunique()

307

In [87]:
basencoder = catenc.BaseNEncoder(base=5)
basencoder.fit_transform(data_df['City']).head(7)

   City_0  City_1  City_2  City_3  City_4
0       0       0       0       0       1
1       0       0       0       0       1
2       0       0       0       0       1
4       0       0       0       0       2
5       0       0       0       0       3
6       0       0       0       0       4
7       0       0       0       1       0

In [88]:
data_df['Frequency'] = data_df['Frequency'].replace({'Monthly':0, 'Quatrly':1, 'Half Yearly':2})

In [89]:
data_df.groupby('Area')['Frequency'].mean()

Area
AHMEDABAD AMBAVADI    1.879167
AHMEDABAD CG ROAD     1.800000
AHMEDNAGAR            1.950000
AKOLA                 1.938462
AMRAVATI              1.975610
                        ...
UJJAIN                2.000000
VIDISHA               1.673529
VIJAYAWADA            1.991228
VISHAKHAPATNAM        0.821429
YAMUNANAGAR           1.166667
Name: Frequency, Length: 80, dtype: float64

In [93]:
print('Before Unique count corresponding to Area:', data_df['Area'].nunique())
print('After Unique count corresponding to Area:', data_df.groupby('Area')['Frequency'].mean().nunique())

Before Unique count corresponding to Area: 80
After Unique count corresponding to Area: 66